# Fire up

In [2]:
import pandas as pd

# Load a tabular data set

In [3]:
df = pd.read_csv('people-example.csv')

# dataframe basics

In [4]:
df #we can view first few lines of table

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [5]:
df.shape

(7, 4)

In [6]:
df.head()

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [7]:
df.tail()

  First Name Last Name        Country  age
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

# Pandas plot

In [1]:
# df.show()

In [17]:
df['age'].describe()

count     7.000000
mean     23.142857
std       1.069045
min      22.000000
25%      22.500000
50%      23.000000
75%      23.500000
max      25.000000
Name: age, dtype: float64

# Inspect columns of dataset

In [19]:
df[['Country']]

         Country
0  United States
1         Canada
2        England
3            USA
4         Poland
5  United States
6    Switzerland

In [21]:
df[['age']]

   age
0   24
1   23
2   22
3   23
4   23
5   22
6   25

In [22]:
df[['age']].describe()

             age
count   7.000000
mean   23.142857
std     1.069045
min    22.000000
25%    22.500000
50%    23.000000
75%    23.500000
max    25.000000

In [23]:
df[['age']].describe

<bound method NDFrame.describe of    age
0   24
1   23
2   22
3   23
4   23
5   22
6   25>

In [24]:
df[['age']].mean()

age    23.142857
dtype: float64

In [25]:
df[['age']].max()

age    25
dtype: int64

# Create new columns in our data Frame

In [26]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [29]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [30]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [31]:
df['age'] + 2

0    26
1    25
2    24
3    25
4    25
5    24
6    27
Name: age, dtype: int64

In [32]:
df['age'] * df['age']

0    576
1    529
2    484
3    529
4    529
5    484
6    625
Name: age, dtype: int64

# Use apply function to do advance transformation of our data

In [34]:
df['Country'] #usa & united states

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [35]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [36]:
transform_country('Brazil')

'Brazil'

In [37]:
transform_country('USA')

'United States'

In [38]:
df['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [39]:
df['Country'] = df['Country'].apply(transform_country)

In [40]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward